app/controllers/transcodes_controller.rb

  def index
    @transcodes = Transcode.all
---
SELECT "transcodes".* FROM "transcodes"

  def create
    @transcode = Transcode.new(transcode_params)

    respond_to do |format|
      if @transcode.save
---
INSERT INTO "transcodes" ("title", "general_option", "infile_option", "outfile_option", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def set_transcode
      @transcode = Transcode.find(params[:id])
---
SELECT  "transcodes".* FROM "transcodes" WHERE "transcodes"."id" = $1 LIMIT 1  [["id", 1]]