app/controllers/workflows_controller.rb

SELECT "workflows".* FROM "workflows"
---
  def index
    @workflows = Workflow.all

INSERT INTO "workflows" ("title", "kind", "active", "in_folder", "out_folder", "transcode_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @workflow = Workflow.new(workflow_params)

    respond_to do |format|
      if @workflow.save

UPDATE "workflows" SET "in_folder" = $1, "out_folder" = $2, "updated_at" = $3 WHERE "workflows"."id" = $4  [["in_folder", "smb://storage/folder/in"], ["out_folder", "smb://storage/folder/out"], ["updated_at", "2016-02-07 23:19:04.603197"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @workflow.update(workflow_params)

SELECT  "workflows".* FROM "workflows" WHERE "workflows"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_workflow
      @workflow = Workflow.find(params[:id])